"use strict"
/*          Symbol.iterator        */
{
    // Обратите внимание на ключевую особенность итераторов: разделение ответственности.

    // У самого range нет метода next().
    // Вместо этого другой объект, так называемый «итератор», создаётся 
    // вызовом range[Symbol.iterator](), и именно его next() генерирует значения.
    // Таким образом, объект итератор отделён от самого итерируемого объекта.

    // Технически мы можем объединить их и использовать сам range как итератор, чтобы упростить код.

    let range = {
        from: 1,
        to: 5,

        [Symbol.iterator]() {
            this.current = this.from;
            return this;
        },

        next() {
            if (this.current <= this.to) {
                return { done: false, value: this.current++ };
            } else {
                return { done: true };
            }
        }
    };

    for (let num of range) {
        alert(num); // 1, затем 2, 3, 4, 5
    }
}
/*---------------------------------------*/
/*          Строка – перебираемый объект        */
{
    // Среди встроенных перебираемых объектов наиболее широко используются массивы и строки.

    // Для строки for..of перебирает символы:

    for (let char of "test") {
        // срабатывает 4 раза: по одному для каждого символа
        alert( char ); // t, затем e, затем s, затем t
    }

    // И он работает корректно даже с суррогатными парами!

    let str = '𝒳😂';
    for (let char of str) {
        alert( char ); // 𝒳, а затем 😂
    }
}
/*---------------------------------------*/
/*          Явный вызов итератора        */
{
    // Мы будем перебирать строку точно так же, как цикл for..of, но вручную, прямыми вызовами. 
    // Нижеприведённый код получает строковый итератор и берёт из него значения:

    let str = "Hello";

    // делает то же самое, что и
    // for (let char of str) alert(char);

    let iterator = str[Symbol.iterator]();

    while (true) {
    let result = iterator.next();
    if (result.done) break;
    alert(result.value); // выводит символы один за другим
    }
}
/*---------------------------------------*/
/*          Итерируемые объекты и псевдомассивы        */
{
    // А вот объект, который является псевдомассивом, но его нельзя итерировать:

    let arrayLike = { // есть индексы и свойство length => псевдомассив
        0: "Hello",
        1: "World",
        length: 2
    };

    // Ошибка (отсутствует Symbol.iterator)

    for (let item of arrayLike) {}

    // Что у них общего? И итерируемые объекты, и псевдомассивы – это обычно не массивы, 
    // у них нет методов push, pop и т.д. Довольно неудобно, если у нас есть такой объект и 
    // мы хотим работать с ним как с массивом. Например, мы хотели бы работать с range, 
    // используя методы массивов. Как этого достичь?
}
/*---------------------------------------*/
/*          Array.from        */
{

    // Есть универсальный метод Array.from, который принимает итерируемый объект или 
    // псевдомассив и делает из него «настоящий» Array. После этого мы уже можем 
    // использовать методы массивов.

    let arrayLike = {
        0: "Hello",
        1: "World",
        length: 2
    };

    let arr = Array.from(arrayLike); // (*)
    alert(arr.pop()); // World (метод работает)
    
    // Array.from в строке (*) принимает объект, проверяет, является ли он итерируемым объектом или 
    // псевдомассивом, затем создаёт новый массив и копирует туда все элементы.

    // То же самое происходит с итерируемым объектом:

    // range взят из примера выше
    arr = Array.from(range);
    alert(arr); // 1,2,3,4,5 (преобразование массива через toString работает)

    // Полный синтаксис Array.from позволяет указать необязательную «трансформирующую» функцию:

    // Array.from(obj[, mapFn, thisArg])
    // Необязательный второй аргумент может быть функцией, 
    // которая будет применена к каждому элементу перед добавлением в массив, 
    // а thisArg позволяет установить this для этой функции.

    // range взят из примера выше

    // возводим каждое число в квадрат
    arr = Array.from(range, num => num * num);

    alert(arr); // 1,4,9,16,25

    // Здесь мы используем Array.from, чтобы превратить строку в массив её элементов:

    let str = '𝒳😂';

    // разбивает строку на массив её элементов
    let chars = Array.from(str);

    alert(chars[0]); // 𝒳
    alert(chars[1]); // 😂
    alert(chars.length); // 2
    // В отличие от str.split, этот метод в работе опирается на итерируемость строки, 
    // и поэтому, как и for..of, он корректно работает с суррогатными парами.

    // Технически это то же самое, что и:

    str = '𝒳😂';

    chars = []; // Array.from внутри себя выполняет тот же цикл
    for (let char of str) {
    chars.push(char);
    }

    alert(chars);

    // …Но гораздо короче.

    // Мы можем даже создать slice, который поддерживает суррогатные пары:

    function slice(str, start, end) {
    return Array.from(str).slice(start, end).join('');
    }

    str = '𝒳😂𩷶';

    alert( slice(str, 1, 3) ); // 😂𩷶

    // а вот встроенный метод не поддерживает суррогатные пары
    alert( str.slice(1, 3) ); // мусор (две части различных суррогатных пар)
}
/*---------------------------------------*/
/*          Итого        */
{
 
    // Объекты, которые можно использовать в цикле for..of, называются итерируемыми.

    // Технически итерируемые объекты должны иметь метод Symbol.iterator.

    // Результат вызова obj[Symbol.iterator] называется итератором. Он управляет процессом итерации.

    // Итератор должен иметь метод next(), который возвращает объект {done: Boolean, value: any}, 
    // где done:true сигнализирует об окончании процесса итерации, в противном случае value – 
    // следующее значение.

    // Метод Symbol.iterator автоматически вызывается циклом for..of, но можно вызвать его и напрямую.
    // Встроенные итерируемые объекты, такие как строки или массивы, 
    // также реализуют метод Symbol.iterator.

    // Строковый итератор знает про суррогатные пары.

    // Объекты, имеющие индексированные свойства и length, называются псевдомассивами. 
    // Они также могут иметь другие свойства и методы, но у них нет встроенных методов массивов.

    // Если мы заглянем в спецификацию, мы увидим, что большинство встроенных методов 
    // рассчитывают на то, что они будут работать с итерируемыми объектами или псевдомассивами 
    // вместо «настоящих» массивов, потому что эти объекты более абстрактны.

    // Array.from(obj[, mapFn, thisArg]) создаёт настоящий Array из итерируемого объекта 
    // или псевдомассива obj, и затем мы можем применять к нему методы массивов. 
    // Необязательные аргументы mapFn и thisArg позволяют применять 
    // функцию с задаваемым контекстом к каждому элементу.

}
/*---------------------------------------*/
